armade/contiki_sam4s/cpu/avr/radio/rf230bb/rf230bb.c
/* Track flow through mac, rdc and radio drivers, see contiki-raven-main.c for example of use */
#if DEBUGFLOWSIZE
extern uint8_t debugflowsize,debugflow[DEBUGFLOWSIZE];
#define DEBUGFLOW(c) if (debugflowsize<(DEBUGFLOWSIZE-1)) debugflow[debugflowsize++]=c
#else
#define DEBUGFLOW(c)
#endif

static radio_status_t radio_set_trx_state(uint8_t new_state);

/* XXX hack: these will be made as Chameleon packet attributes */
#if RF230_CONF_TIMESTAMPS
rtimer_clock_t rf230_time_of_arrival, rf230_time_of_departure;

int rf230_authority_level_of_sender;

static rtimer_clock_t setup_time_for_transmission;
static unsigned long total_time_for_transmission, total_transmission_len;
static int num_transmissions;
#endif

#if defined(__AVR_ATmega128RFA1__) || defined(__AVR_ATmega128RFR2__) || defined(__AVR_ATmega256RFR2__)
volatile uint8_t rf230_wakewait, rf230_txendwait, rf230_ccawait;
#endif

uint8_t volatile rf230_pending;

/* RF230 hardware delay times, from datasheet */
typedef enum{
    TIME_TO_ENTER_P_ON               = 510, /**<  Transition time from VCC is applied to P_ON - most favorable case! */
    TIME_P_ON_TO_TRX_OFF             = 510, /**<  Transition time from P_ON to TRX_OFF. */
    TIME_SLEEP_TO_TRX_OFF            = 880, /**<  Transition time from SLEEP to TRX_OFF. */
    TIME_RESET                       = 6,   /**<  Time to hold the RST pin low during reset */
    TIME_ED_MEASUREMENT              = 140, /**<  Time it takes to do a ED measurement. */
    TIME_CCA                         = 140, /**<  Time it takes to do a CCA. */
    TIME_PLL_LOCK                    = 150, /**<  Maximum time it should take for the PLL to lock. */
    TIME_FTN_TUNING                  = 25,  /**<  Maximum time it should take to do the filter tuning. */
    TIME_NOCLK_TO_WAKE               = 6,   /**<  Transition time from *_NOCLK to being awake. */
    TIME_CMD_FORCE_TRX_OFF           = 1,   /**<  Time it takes to execute the FORCE_TRX_OFF command. */
    TIME_TRX_OFF_TO_PLL_ACTIVE       = 180, /**<  Transition time from TRX_OFF to: RX_ON, PLL_ON, TX_ARET_ON and RX_AACK_ON. */
    TIME_STATE_TRANSITION_PLL_ACTIVE = 1,   /**<  Transition time from PLL active state to another. */
}radio_trx_timing_t;
/*---------------------------------------------------------------------------*/
PROCESS(rf230_process, "RF230 driver");
/*---------------------------------------------------------------------------*/

int rf230_interrupt(void);

static int rf230_on(void);
static int rf230_off(void);

static int rf230_read(void *buf, unsigned short bufsize);

static int rf230_prepare(const void *data, unsigned short len);
static int rf230_transmit(unsigned short len);
static int rf230_send(const void *data, unsigned short len);

static int rf230_receiving_packet(void);
static int rf230_pending_packet(void);
static int rf230_cca(void);

uint8_t rf230_last_correlation,rf230_last_rssi,rf230_smallest_rssi;

static void
set_poll_mode(bool enable)
{
  poll_mode = enable;
  if(poll_mode) {
    rf230_set_rpc(0x0); /* Disbable all RPC features */
    radio_set_trx_state(RX_ON);
    hal_subregister_write(SR_IRQ_MASK, RF230_SUPPORTED_INTERRUPT_MASK);
    /* hal_register_write(RG_IRQ_MASK, 0xFF); */
  } else {
    /* Initialize and enable interrupts */
    rf230_set_rpc(0xFF); /* Enable all RPC features. Only XRFR2 radios */
    radio_set_trx_state(RX_AACK_ON);
  }
}

static bool
get_poll_mode(void)
{
  return poll_mode;
}

static void
set_frame_filtering(bool i)
{
  if(i)
    hal_subregister_write(SR_AACK_PROM_MODE, 0);
  else {
    hal_subregister_write(SR_AACK_PROM_MODE, 1);
  }
}

static bool
get_frame_filtering(void)
{
  int i = hal_subregister_read(SR_AACK_PROM_MODE);
  if(i)
    return 0;
  return 1;
}

static void
set_auto_ack(bool i)
{
  if(i)
    hal_subregister_write(SR_AACK_DIS_ACK, 0);
  else
    hal_subregister_write(SR_AACK_DIS_ACK, 1);
}

static bool
get_auto_ack(void)
{
  int i = hal_subregister_read(SR_AACK_DIS_ACK);
  if(i)
    return 0;
  return 1;
}

uint16_t
rf230_get_panid(void)
{
  unsigned pan;
  uint8_t byte;

  byte = hal_register_read(RG_PAN_ID_1);
  pan = byte;
  byte = hal_register_read(RG_PAN_ID_0);
  pan = (pan << 8) + byte;

  return pan;
}

static void
rf230_set_panid(uint16_t pan)
{
  hal_register_write(RG_PAN_ID_1, (pan >> 8));
  hal_register_write(RG_PAN_ID_0, (pan & 0xFF));
}

static uint16_t
rf230_get_short_addr(void)
{
  unsigned char a0, a1;
  a0 = hal_register_read(RG_SHORT_ADDR_0);
  a1 = hal_register_read(RG_SHORT_ADDR_1);
  return (a1 << 8) | a0;
}

static void
rf230_set_short_addr(uint16_t addr)
{
  hal_register_write(RG_SHORT_ADDR_0, (addr & 0xFF));
  hal_register_write(RG_SHORT_ADDR_1, (addr >> 8));
}

#define RSSI_BASE_VAL (-90)

/* Returns the current CCA threshold in dBm */
static radio_value_t
rf230_get_cca_threshold()
{
  radio_value_t cca_thresh = 0;

  cca_thresh = hal_subregister_read(SR_CCA_ED_THRES);
  cca_thresh = RSSI_BASE_VAL + 2 * cca_thresh;
  return cca_thresh;
}

/* Sets the CCA threshold in dBm */
static radio_value_t
rf230_set_cca_threshold(radio_value_t cca_thresh)
{

  if(cca_thresh > -60)  /* RSSI_BASE_VAL - 2 * 0xF */
    cca_thresh = -60;
  
  cca_thresh = (RSSI_BASE_VAL - cca_thresh)/2;
  if(cca_thresh < 0)
    cca_thresh = - cca_thresh;

  hal_subregister_write(SR_CCA_ED_THRES, cca_thresh);
  return cca_thresh;
}

/*---------------------------------------------------------------------------*/
static radio_result_t
get_value(radio_param_t param, radio_value_t *value)
{
  if(!value) {
    return RADIO_RESULT_INVALID_VALUE;
  }

  switch(param) {
  case RADIO_PARAM_POWER_MODE:
    *value = rf230_is_sleeping() ?  RADIO_POWER_MODE_OFF : RADIO_POWER_MODE_ON; 
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TX_MODE:
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CHANNEL:
    *value = (radio_value_t)rf230_get_channel();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_PAN_ID:
    *value = rf230_get_panid();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_16BIT_ADDR:
    *value = rf230_get_short_addr(); 
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
    *value = 0;
    if(get_frame_filtering()) {
      *value |= RADIO_RX_MODE_ADDRESS_FILTER;
    }
    if(get_auto_ack()) {
      *value |= RADIO_RX_MODE_AUTOACK;
    }
    if(get_poll_mode()) {
      *value |= RADIO_RX_MODE_POLL_MODE;
    }
    return RADIO_RESULT_OK;
  case RADIO_PARAM_TXPOWER:
    *value = rf230_get_txpower();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_CCA_THRESHOLD:
    *value = rf230_get_cca_threshold();
    return RADIO_RESULT_OK;
  case RADIO_PARAM_RSSI:
    *value = rf230_get_raw_rssi();
    return RADIO_RESULT_OK;
  case RADIO_CONST_CHANNEL_MIN:
    *value = RF230_MIN_CHANNEL;
    return RADIO_RESULT_OK;
  case RADIO_CONST_CHANNEL_MAX:
    *value = RF230_MAX_CHANNEL;;
    return RADIO_RESULT_OK;
  case RADIO_CONST_TXPOWER_MIN:
    *value = TX_PWR_MIN;
    return RADIO_RESULT_OK;
  case RADIO_CONST_TXPOWER_MAX:
    *value = TX_PWR_MAX;
    return RADIO_RESULT_OK;
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_value(radio_param_t param, radio_value_t value)
{
  switch(param) {
  case RADIO_PARAM_POWER_MODE:
    if(value == RADIO_POWER_MODE_ON) {
      rf230_on();
      return RADIO_RESULT_OK;
    }
    if(value == RADIO_POWER_MODE_OFF) {
      rf230_off();
      return RADIO_RESULT_OK;
    }
    return RADIO_RESULT_INVALID_VALUE;

