armade/contiki_sam4s/cpu/avr/radio/rf230bb/rf230bb.c
    return sleeping;
}
/*----------------------------------------------------------------------------*/
/** \brief  This function will reset the state machine (to TRX_OFF) from any of
 *          its states, except for the SLEEP state.
 */
static void
radio_reset_state_machine(void)
{
    /* The data sheet is not clear on what happens when slptr is raised in RX on
     * states, it "remains in the new state and returns to the preceding state
     * when slptr is lowered". Possibly that is why there is an undocumented
     * TIME_NOCLK_TO_WAKE delay here?
     */
    if (hal_get_slptr()) {
        DEBUGFLOW('V');
        hal_set_slptr_low();
        delay_us(TIME_NOCLK_TO_WAKE);
    }

    hal_subregister_write(SR_TRX_CMD, CMD_FORCE_TRX_OFF);
    delay_us(TIME_CMD_FORCE_TRX_OFF);
}
/*---------------------------------------------------------------------------*/
static char
rf230_isidle(void)
{
  uint8_t radio_state;
  /* Contikimac can turn the radio off during an interrupt, so we always check
   * slptr before doing the SPI transfer. The caller must also make this test
   * if it could otherwise hang waiting for idle! */
  if (hal_get_slptr()) {
    if (RF230_receive_on) DEBUGFLOW('-');
	  return 1;
  }
  else {
    radio_state = hal_subregister_read(SR_TRX_STATUS);
    if (radio_state != BUSY_TX_ARET &&
      radio_state != BUSY_RX_AACK &&
      radio_state != STATE_TRANSITION &&
      radio_state != BUSY_RX && 
      radio_state != BUSY_TX) {
      return(1);
    }
    else {
      return(0);
    }
  }
}
  
static void
rf230_waitidle(void)
{
  /* TX_ARET with multiple csma retries can take a very long time to finish */
  while (1) {
    if (hal_get_slptr()) return;
    if (rf230_isidle()) break;
  }
}

/* Set reduced power consumption for AtMegaXXXRFR2 MCU's. See AT02594 */

static uint8_t rpc = 0xFF; /* Default max power save */
void 
rf230_set_rpc(uint8_t data)
{
  rpc = data;
}

uint8_t
rf230_get_rpc(void)
{
  return rpc;
}

/** \brief  This function will change the current state of the radio
 *          transceiver's internal state machine.
 *
 *  \param     new_state        Here is a list of possible states:
 *             - RX_ON        Requested transition to RX_ON state.
 *             - TRX_OFF      Requested transition to TRX_OFF state.
 *             - PLL_ON       Requested transition to PLL_ON state.
 *             - RX_AACK_ON   Requested transition to RX_AACK_ON state.
 *             - TX_ARET_ON   Requested transition to TX_ARET_ON state.
 *
 *  \retval    RADIO_SUCCESS          Requested state transition completed
 *                                  successfully.
 *  \retval    RADIO_INVALID_ARGUMENT Supplied function parameter out of bounds.
 *  \retval    RADIO_WRONG_STATE      Illegal state to do transition from.
 *  \retval    RADIO_BUSY_STATE       The radio transceiver is busy.
 *  \retval    RADIO_TIMED_OUT        The state transition could not be completed
 *                                  within resonable time.
 */
static radio_status_t
radio_set_trx_state(uint8_t new_state)
{
    uint8_t current_state;

    /*Check function parameter and current state of the radio transceiver.*/
    if (!((new_state == TRX_OFF)    ||
          (new_state == RX_ON)      ||
          (new_state == PLL_ON)     ||
          (new_state == RX_AACK_ON) ||
          (new_state == TX_ARET_ON))){
        return RADIO_INVALID_ARGUMENT;
    }

	  if (hal_get_slptr()) {
	      DEBUGFLOW('W');
        return RADIO_WRONG_STATE;
    }

    /* Wait for radio to finish previous operation */
    rf230_waitidle();
    current_state = radio_get_trx_state();

    if (new_state == current_state){
        return RADIO_SUCCESS;
    }


    /* At this point it is clear that the requested new_state is: */
    /* TRX_OFF, RX_ON, PLL_ON, RX_AACK_ON or TX_ARET_ON. */

    /* The radio transceiver can be in one of the following states: */
    /* TRX_OFF, RX_ON, PLL_ON, RX_AACK_ON, TX_ARET_ON. */
    if(new_state == TRX_OFF){
        if (hal_get_slptr()) DEBUGFLOW('K');DEBUGFLOW('K');DEBUGFLOW('A'+hal_subregister_read(SR_TRX_STATUS));
        radio_reset_state_machine(); /* Go to TRX_OFF from any state. */
    } else {
        /* It is not allowed to go from RX_AACK_ON or TX_AACK_ON and directly to */
        /* TX_AACK_ON or RX_AACK_ON respectively. Need to go via PLL_ON. */
        /* (Old datasheets allowed other transitions, but this code complies with */
        /* the current specification for RF230, RF231 and 128RFA1.) */
        if (((new_state == TX_ARET_ON) && (current_state == RX_AACK_ON)) ||
            ((new_state == RX_AACK_ON) && (current_state == TX_ARET_ON))){
            /* First do intermediate state transition to PLL_ON. */
            /* The final state transition is handled after the if-else if. */
            hal_subregister_write(SR_TRX_CMD, PLL_ON);
            delay_us(TIME_STATE_TRANSITION_PLL_ACTIVE);
        }

        /* Any other state transition can be done directly. */
        hal_subregister_write(SR_TRX_CMD, new_state);

        /* When the PLL is active most states can be reached in 1us. However, from */
        /* TRX_OFF the PLL needs time to activate. */
        if (current_state == TRX_OFF){

#if defined(__AVR_ATmega128RFR2__) || defined(__AVR_ATmega256RFR2__)  
	  hal_subregister_write(SR_TRX_RPC, rpc);    /* Enable RPC features */
#endif
            delay_us(TIME_TRX_OFF_TO_PLL_ACTIVE);
        } else {
            delay_us(TIME_STATE_TRANSITION_PLL_ACTIVE);
        }
    } /*  end: if(new_state == TRX_OFF) ... */

    /* Verify state transition.
     * Radio could have already switched to an RX_BUSY state, at least in cooja.
     * Don't know what the hardware does but this would not be an error.*/
    current_state = radio_get_trx_state();
    if (current_state != new_state) {
        if (((new_state == RX_ON) && (current_state == BUSY_RX)) ||
            ((new_state == RX_AACK_ON) && (current_state == BUSY_RX_AACK))) {
           /* This is OK. */
        } else {
            DEBUGFLOW('N');DEBUGFLOW('A'+new_state);DEBUGFLOW('A'+radio_get_trx_state());DEBUGFLOW('N');
            return RADIO_TIMED_OUT;
        }
    }

    return RADIO_SUCCESS;
}

void
rf230_set_promiscuous_mode(bool isPromiscuous) {
#if RF230_CONF_AUTOACK
    is_promiscuous = isPromiscuous;
/* TODO: Figure out when to pass promisc state to 802.15.4 */
    radio_set_trx_state(is_promiscuous?RX_ON:RX_AACK_ON);
#endif
}

bool
rf230_is_ready_to_send() {
	switch(radio_get_trx_state()) {
		case BUSY_TX:
		case BUSY_TX_ARET:
			return false;
	}
	
