armade/contiki_sam4s/cpu/avr/radio/rf230bb/rf230bb.c
    /* Enable packet reception */
#ifdef RF230_MIN_RX_POWER
    hal_register_write(RG_RX_SYN, RF230_MIN_RX_POWER/6 + 0x01);
#else
    hal_register_write(RG_RX_SYN, 0x00);
#endif


#else
  /* If already in receive mode can read the current ED register without delay */
  /* CCA energy threshold = -91dB + 2*SR_CCA_ED_THRESH. Reset defaults to -77dB */
#ifdef RF230_CONF_CCA_THRES
    if (hal_register_read(RG_PHY_ED_LEVEL)<(91+RF230_CONF_CCA_THRES)) cca=0xff;
#else
    if (hal_register_read(RG_PHY_ED_LEVEL)<(91-77)) cca=0xff;
#endif
#endif


#else /* RF230, RF231 */
  /* Don't allow interrupts! */
  /* Start the CCA, wait till done, return result */
  /* Note reading the TRX_STATUS register clears both CCA_STATUS and CCA_DONE bits */
{ uint8_t volatile saved_sreg = SREG;
  cli();
  rf230_waitidle();
  hal_subregister_write(SR_CCA_REQUEST,1);
  delay_us(TIME_CCA);
  while ((cca & 0x80) == 0 ) {
    if (hal_get_slptr()) {
        DEBUGFLOW('S');
        break;
    }
    cca=hal_register_read(RG_TRX_STATUS);
  }
  SREG=saved_sreg;
}
#endif
  ENERGEST_OFF(ENERGEST_TYPE_LED_YELLOW); 
  if(radio_was_off) {
    rf230_off();
  }
// if (cca & 0x40) {/*DEBUGFLOW('3')*/;} else {rf230_pending=1;DEBUGFLOW('4');}  
   if (cca & 0x40) {
//   DEBUGFLOW('5');
	 return 1;
   } else {
//  DEBUGFLOW('6');
 busyexit:
	 return 0;
   }
}
/*---------------------------------------------------------------------------*/
int
rf230_receiving_packet(void)
{
  uint8_t radio_state;
  if (hal_get_slptr()) {
    DEBUGFLOW('=');
  } else {  
    radio_state = hal_subregister_read(SR_TRX_STATUS);
    if ((radio_state==BUSY_RX) || (radio_state==BUSY_RX_AACK)) {
//      DEBUGFLOW('8');
      return 1;
    }
  }
  return 0;
}
/*---------------------------------------------------------------------------*/
static int
rf230_pending_packet(void)
{
#if RF230_INSERTACK
    if(ack_pending == 1) return 1;
#endif
  return rf230_pending;
}
/*---------------------------------------------------------------------------*/
#if RF230_CONF_SNEEZER && JACKDAW
/* See A.2 in the datasheet for the sequence needed.
 * This version for RF230 only, hence Jackdaw.
 * A full reset seems not necessary and allows keeping the pan address, etc.
 * for an easy reset back to network mode.
 */
void rf230_start_sneeze(void) {
//write buffer with random data for uniform spectral noise

//uint8_t txpower = hal_register_read(0x05);  //save auto_crc bit and power
//  hal_set_rst_low();
//  hal_set_slptr_low();
//  delay_us(TIME_RESET);
//  hal_set_rst_high();
    hal_register_write(0x0E, 0x01);
    hal_register_write(0x02, 0x03);
    hal_register_write(0x03, 0x10);
 // hal_register_write(0x08, 0x20+26);    //channel 26
    hal_subregister_write(SR_CCA_MODE,1); //leave channel unchanged

 // hal_register_write(0x05, 0x00);       //output power maximum
    hal_subregister_write(SR_TX_AUTO_CRC_ON, 0);  //clear AUTO_CRC, leave output power unchanged
 
    hal_register_read(0x01);             //should be trx-off state=0x08  
    hal_frame_write(buffer, 127);        //maximum length, random for spectral noise 

    hal_register_write(0x36,0x0F);       //configure continuous TX
    hal_register_write(0x3D,0x00);       //Modulated frame, other options are:
//  hal_register_write(RG_TX_2,0x10);    //CW -2MHz
//  hal_register_write(RG_TX_2,0x80);    //CW -500KHz
//  hal_register_write(RG_TX_2,0xC0);    //CW +500KHz

    DDRB  |= 1<<7;                       //Raven USB stick has PB7 connected to the RF230 TST pin.   
    PORTB |= 1<<7;                       //Raise it to enable continuous TX Test Mode.

    hal_register_write(0x02,0x09);       //Set TRX_STATE to PLL_ON
    delay_us(TIME_TRX_OFF_TO_PLL_ACTIVE);
    delay_us(TIME_PLL_LOCK);
    delay_us(TIME_PLL_LOCK);
 // while (hal_register_read(0x0f)!=1) {continue;}  //wait for pll lock-hangs
    hal_register_write(0x02,0x02);       //Set TRX_STATE to TX_START
}

#endif

#ifdef AES_128_HW_CONF
#define IEEE_VECT 0

extern unsigned char aes_key[16];
extern unsigned char aes_p[];
extern unsigned char aes_c[];
extern unsigned char aes_s[];
extern unsigned char tmp[16];

/*
  After PWR_SAVE sleep key is lost. We'll lock en/decyption to avoid
  not to forced in to sleep while doing crypto. Also the key is hold
  be the user so AES block should be reentrant. Encode/Docode och 128bit
  (16 bytes) is promised to be less than 24us. 
  Note! Radio must be on to use the HW crypto engine. --ro
*/

static void
rf230_aes_write_key(unsigned char *key)
{
  uint8_t i;
  for(i = 0; i < 16; i++) {
    hal_subregister_write(SR_AES_KEY, key[i]);
  }
}
static void
rf230_aes_read_key(unsigned char *key)
{
  uint8_t i;
  for(i = 0; i < 16; i++) {
    key[i] = hal_subregister_read(SR_AES_KEY);
  }
}
static void
rf230_aes_write_state(unsigned char *state)
{
  uint8_t i;
  for(i = 0; i < 16; i++) {
    hal_subregister_write(SR_AES_STATE, state[i]);
  }
}
static void
rf230_aes_read_state(unsigned char *state)
{
  uint8_t i;
  for(i = 0; i < 16; i++) {
    state[i] = hal_subregister_read(SR_AES_STATE);
  }
}

static int
crypt(void)
{
  uint8_t status;

  hal_subregister_write(SR_AES_CNTRL_REQUEST, 1); /* Kick */

  do {
    watchdog_periodic();
    status = hal_subregister_read(SR_AES_STATUS);
  } while(status == 0);

  if (hal_subregister_read(SR_AES_STATUS_ERR)) {
      PRINTF("AES ERR\n");
      return 0;
  }
  if (hal_subregister_read(SR_AES_STATUS_DONE)) {
      PRINTF("AES DONE\n");
      return 1;
  }
  return 0; /* Unknown */
}

int
rf230_aes_encrypt_cbc(unsigned char *key, unsigned char *plain, int len, unsigned char *mic)
{
  uint8_t i;
  uint8_t sreg;
  int res;

  sreg = SREG;
  cli();
  rf230_aes_write_key(key);
  hal_subregister_write(SR_AES_CNTRL_MODE, 0); /* AES_MODE=0 -> ECB  for 1:st block*/
  hal_subregister_write(SR_AES_CNTRL_DIR, 0); /* AES_DIR=0 -> encryption */

  /* write string to encrypt into buffer */
  for(i = 0; i < 16; i++) {
    AES_STATE = plain[i] ^ IEEE_VECT;
  }
  res = crypt();
  if(!res)
    goto out;

  len -= 16;
  /* Swiitch Mode */
  hal_subregister_write(SR_AES_CNTRL_MODE, 1); /* AES_MODE=1 -> CBC */
  hal_subregister_write(SR_AES_CNTRL_DIR, 0); /* AES_DIR=0 -> encryption */

  while(len > 0) {
    rf230_aes_write_state(plain);
    res = crypt();
    if(!res)
      goto out;

    len -= 16;
  }
  /* Read and retrun cipher */
  rf230_aes_read_state(mic);

out:
  SREG = sreg;
  return res;
}

/* Electonic Code Block */
int
rf230_aes_encrypt_ebc(unsigned char *key, unsigned char *plain, unsigned char *cipher)
{
  int res;
  uint8_t sreg;

  sreg = SREG;
  cli();
  rf230_aes_write_key(key);
  hal_subregister_write(SR_AES_CNTRL_MODE, 0); /* AES_MODE=0 -> ECB  for 1:st block*/
  hal_subregister_write(SR_AES_CNTRL_DIR, 0); /* AES_DIR=0 -> encryption */
  rf230_aes_write_state(plain);   /* write string to encrypt into buffer */
  res = crypt();
  if(!res)
    goto out;
  rf230_aes_read_state(cipher); /* Read and return cipher */

out:
  SREG = sreg;
  return res;
}

int
rf230_aes_decrypt_ebc(unsigned char *key, unsigned char *cipher, unsigned char *plain)
{
  int res;
  uint8_t sreg;
  /*
     Dummy encryption of 0 w. original key
     to get last round key to be used decrytion
   */

  sreg = SREG;
  cli();

  rf230_aes_write_key(key);
  hal_subregister_write(SR_AES_CNTRL_MODE, 0); /* AES_MODE=0 -> ECB  for 1:st block*/
  hal_subregister_write(SR_AES_CNTRL_DIR, 0); /* AES_DIR=0 -> encryption */
  memset(tmp, 0, sizeof(tmp)); /* Setup for last round */
  rf230_aes_write_state(tmp);
  res = crypt();
  if(!res)
    goto out;

  rf230_aes_read_key(tmp);/* Save the last round key */
  /* And use as decrytion key */
  rf230_aes_write_key(tmp);
  hal_subregister_write(SR_AES_CNTRL_MODE, 0); /* AES_MODE=0 -> ECB  for 1:st block*/
  hal_subregister_write(SR_AES_CNTRL_DIR, 1); /* AES_DIR=1 -> decryption */
  /* Write string to decrypt into buffer */
  rf230_aes_write_state(cipher);
  res = crypt();
  if(!res)
    goto out;
  rf230_aes_read_state(plain);   /* Read plaintext into string */

out:
  SREG = sreg;
  return res;
}
#endif /* AES_128_HW_CONF */
